swat-dp-tools/soma/xml/setfile.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:dp="http://www.datapower.com/schemas/management" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Body>
        <dp:request domain="@domain.name@">
            <dp:set-file name="@dp.file.name@">@soma.content@</dp:set-file>
        </dp:request>
    </soapenv:Body>
</soapenv:Envelope>